benchmark/report/rps/full/20260804_163035/raw/003_health_c50_r1.txt
Running 20s test @ http://127.0.0.1:32779/api/health
  8 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.19ms    1.24ms  31.07ms   81.18%
    Req/Sec     1.89k   235.22     2.49k    72.56%
  Latency Distribution
     50%    3.02ms
     75%    3.69ms
     90%    4.47ms
     99%    6.68ms
  301345 requests in 20.02s, 134.78MB read
Requests/sec:  15052.05
Transfer/sec:      6.73MB
HPS_WRK_REQUESTS 301345
HPS_WRK_STATUS_ERRORS 0
HPS_SOCKET_CONNECT 0
HPS_SOCKET_READ 0
HPS_SOCKET_WRITE 0
HPS_SOCKET_TIMEOUT 0
HPS_STATUS_TOTAL 301345
HPS_STATUS_2XX 301345
HPS_STATUS_NON_2XX 0
HPS_STATUS_UNEXPECTED 0
HPS_STATUS_CODES 200=301345